БухЭксп/Catalogs/CW_ДоходыНерезидентовСоответствиеЗаполненияСтрок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ДоходыНерезидентовСоответствиеЗаполненияСтрок</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Основная</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедакцияОтчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Приказ</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ДоходыНерезидентовЯчейкиРаздела</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НастройкиСтрок</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ЯчейкаОтчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ДоходыНерезидентовЯчейкиРаздела</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеЯчейки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_ДоходыНерезидентовФункцииЗначенийЯчеекОтчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/ChartsOfCharacteristicTypes/CW_ДоходыНерезидентовЯчейкиРаздела.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<ChartOfCharacteristicTypes>
		<Properties>
			<Name>CW_ДоходыНерезидентовЯчейкиРаздела</Name>
			<Type>
				<v8:Type>xs:string</v8:Type>
				<v8:Type>xs:dateTime</v8:Type>
				<v8:Type>xs:decimal</v8:Type>
				<v8:NumberQualifiers>
					<v8:Digits>16</v8:Digits>
					<v8:FractionDigits>2</v8:FractionDigits>
				</v8:NumberQualifiers>
				<v8:StringQualifiers>
					<v8:Length>255</v8:Length>
				</v8:StringQualifiers>
				<v8:DateQualifiers>
					<v8:DateFractions>Date</v8:DateFractions>
				</v8:DateQualifiers>
			</Type>
			<Hierarchical>true</Hierarchical>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяЯчейки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерСтроки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>3</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонтролироватьЗаполнение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</ChartOfCharacteristicTypes>
</MetaDataObject>

БухЭксп/Catalogs/CW_ДоходыНерезидентовСоответствиеЗаполненияСтрок/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	
	Элементы.Приказ.СписокВыбора.Добавить(ПредопределенноеЗначение("ПланВидовХарактеристик.CW_ДоходыНерезидентовЯчейкиРаздела.Отчет_2023Кв4_Раздел42"));
	
	Если Параметры.Ключ.Пустая() Тогда
		ИндексТекущегоПриказа 	= Элементы.Приказ.СписокВыбора.Количество()-1;  
		ЭлементСписка 			= Элементы.Приказ.СписокВыбора.Получить(ИндексТекущегоПриказа);
		Объект.Приказ 			= ЭлементСписка.Значение; 
		ПриказПриИзмененииНаСервере();
	Конецесли;  
	
	Если Элементы.Приказ.СписокВыбора.Количество() = 1 Тогда
		Элементы.Приказ.ТолькоПросмотр = Истина;
	КонецЕсли;
	
КонецПроцедуры  

&НаКлиенте
Процедура ПриказПриИзменении(Элемент)
	ПриказПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриказПриИзмененииНаСервере()
	
	Объект.РедакцияОтчета = Объект.Приказ.ДатаНачала;  
	ЗаполнитьНастрокйиСтрокиНаСервере();
	
КонецПроцедуры


&НаКлиенте
Процедура НастройкиСтрокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	Отказ = Истина;
КонецПроцедуры   

&НаКлиенте
Процедура НастройкиСтрокПередУдалением(Элемент, Отказ)
	Отказ = Истина;
КонецПроцедуры  

&НаСервере
Процедура ЗаполнитьНастрокйиСтрокиНаСервере()   

	Объект.НастройкиСтрок.Очистить();
	
	Запрос = новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДоходыНерезидентовЯчейкиРаздела.Ссылка КАК ЯчейкаОтчета
	               |ИЗ
	               |	ПланВидовХарактеристик.CW_ДоходыНерезидентовЯчейкиРаздела КАК CW_ДоходыНерезидентовЯчейкиРаздела
	               |ГДЕ
	               |	CW_ДоходыНерезидентовЯчейкиРаздела.Родитель = &Родитель
	               |	И CW_ДоходыНерезидентовЯчейкиРаздела.ЭтоГруппа = ЛОЖЬ
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ИмяЯчейки
	               |АВТОУПОРЯДОЧИВАНИЕ";   
	
	Запрос.УстановитьПараметр("Родитель", Объект.Приказ);   
	
	РезультатЗапроса = Запрос.Выполнить(); 

	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.НастройкиСтрок.Добавить();
		НоваяСтрока.ЯчейкаОтчета = Выборка.ЯчейкаОтчета;
	КонецЦикла; 
	
КонецПроцедуры
